custom_cases/heatedCavity/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| blockMesh for heated cavity                                               |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

vertices
(
    (0 0 0)
    (1 0 0)
    (1 1 0)
    (0 1 0)
    (0 0 0.01)
    (1 0 0.01)
    (1 1 0.01)
    (0 1 0.01)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (40 40 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    hotWall
    {
        type wall;
        faces
        (
            (0 3 7 4)
        );
    }

    coldWall
    {
        type wall;
        faces
        (
            (1 2 6 5)
        );
    }

    adiabaticWalls
    {
        type wall;
        faces
        (
            (3 2 6 7)
            (0 1 5 4)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 2 3)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

