custom_cases/heatedCavity/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    hotWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          40;
        startFace       3120;
    }
    coldWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          40;
        startFace       3160;
    }
    adiabaticWalls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          80;
        startFace       3200;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          3200;
        startFace       3280;
    }
)

// ************************************************************************* //
